cf/AccumulationRegisters/GoodsInWarehouses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>GoodsInWarehouses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/CommonModules/ProductsInDocuments/Ext/Module.bsl
Procedure CheckGoodsInWarehouseBalance(Products, Warehouse, Date, Cancel, Company = Undefined) Export

	If Company <> Undefined Then
		CheckBalanceOfGoods = GetFunctionalOption("ContolBalanceOfGoods", New Structure("Company", Company));
	Else
		CheckBalanceOfGoods = Constants.ContolBalanceOfGoods.Get();
	EndIf;
	
	If Not CheckBalanceOfGoods Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	GoodsInWarehousesBalance.Product AS Product,
	|	GoodsInWarehousesBalance.QuantityBalance AS Quantity
	|FROM
	|	AccumulationRegister.GoodsInWarehouses.Balance(
	|			&Period,
	|			Product IN (&Products)
	|				AND Warehouse = &Warehouse) AS GoodsInWarehousesBalance
	|WHERE
	|	GoodsInWarehousesBalance.QuantityBalance < 0";

	Query.SetParameter("Period", 	New Boundary(Date, BoundaryType.Including));
	Query.SetParameter("Products", 	Products);
	Query.SetParameter("Warehouse", Warehouse);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		MessageText = StrTemplate(
			"Not enough %1 units of product %2 in the warehouse %3",
			- Selection.Quantity,
			Selection.Product,
			Warehouse
		);
		Message(MessageText);
		Cancel = True;
	EndDo;
	
EndProcedure
